{"id":"8","title":"Sobrecarga de funções em JavaScript","by":"Diullei Gomes","tags":["JavaScript","Pattern","OO"],"category":"JavaScript","date":1344394800000,"deploy":"true","content":"## Introdução\r\n\nComo sabemos o JavaScript não implementa um conceito de sobrecarga de funções. O que costumamos fazer quando precisamos de uma função que pode ter mais de uma assinatura padrão é emular de algum modo este comportamento. \r\n\r\nPodemos fazer isso de várias maneiras diferentes. Vou aprensentar neste artigo algumas dessas maneiras para que possamos refletir sobre o tema.\r\n\r\n### Um cenário comum\r\n\r\nVamos imaginar que gostariamos de ter uma função capaz de aceitar diferentes tipos argumentos e ter como resultado algo de acordo com o que a sobrecarga invocada se propõe a retornar. \r\n\n> NOTA: Normalmente em OOP clássico uma sobrecarga não pode redefinir o tipo retornado mas em JavaScript temos a possibilidade de retornar o que quisermos de uma função.\r\n\r\nEntão vamos a um exemplo bem básico de uso de um objeto que contém uma função com sobrecarga:\r\n\r\n<pre><code>// criando uma instância do nosso objeto\r\nvar eu = new Pessoa;\r\n\r\n// adicionando valores ao nosso objeto. Veja que as funções nome e idade estão retornando como \r\n// resultado o proprio objeto e é isso que nos permite fazer o encadeamento da função \r\n// nome e idade de forma sequencial.\r\neu.nome('Diullei').idade(29);\r\n\r\n// aqui estou acessando uma sobre carga da função nome que para este objeto \"Pessoa\" \r\n// está definida para que quando nenhum argumento for passado esta retorne o valor da \r\n// propriedade nome e não a instância do proprio objeto.\r\nconsole.log(eu.nome());\r\n//=> Diullei</code></pre>\r\n\r\nComo já foi dito nos comentários o objeto Pessoa no código acima possui uma função nome que possui duas assinaturas diferentes. Na primenria passamos um nome e esperamos a partir daí que a propria instância do objeto seja retornada e na segunda não passamos nenhum valor esperando que o valor da propriedade nome seja retornado.\r\n\r\n## Implementando a classe Pessoa\r\n\r\nVamos exibir então am alguns exemplos algumas diferentes formas de implementar a classe pessoa para que esta possa atender o código acima.\r\n\r\nO javascript nos dá dentro do contexto de uma função uma instância de objeto muito interessante chamada arguments. Graças a este objeto conseguiremos simular a sobrecarga. Com ele podemos descobrir quais os valores dos argumentos que foram passados para nossa função mesmo que não tenhamos nomeado estes argumentos. Veja um exemplo:\r\n\r\n<pre data-stjf='data-stjf' data-js=\"function log(msg){ document.write('<div>' + msg + '</div>'); }\n\nfunction teste(){\n\tlog(arguments.length);\n}\n\nteste(1,2,3,4);\"><code>...\nfunction teste(){\r\n\t// exibindo no console a quantidade de argumentos passados para a função\r\n\tconsole.log(arguments.length);\r\n}\r\n\r\n// ao passar quatro argumentos para a função teremos a saída de console: 4\r\nteste(1,2,3,4);\r\n//=> 4\n...</code></pre>\r\n\r\nSe quisermos por exemplo recuperar o valor so primeiro argumento passado para a função podemos fazer deste jeito:\r\n\r\n<pre data-stjf='data-stjf' data-js=\"function log(msg){ document.write('<div>' + msg + '</div>'); }\n\nfunction teste(){\n\tconsole.log(arguments[0]);\n}\n\nteste('Diullei Gomes');\"><code>...\r\nfunction teste(){\r\n\t// exibindo no console a quantidade de argumentos passados para a função\r\n\tconsole.log(arguments[0]);\r\n}\r\n\r\n// ao passar quatro argumentos para a função teremos a saída de console: 4\r\nteste('Diullei Gomes');\r\n//=> Diullei Gomes\r\n...</code></pre>\r\n\r\nEntendendo isso podemos concluir que basta uma análize dos argumentos passados para a função para decidir qual comportamento executar.\r\n\r\n### Uma implementação simples\r\n\r\n<pre data-stjf='data-stjf' data-js=\"function Pessoa(){}\n\nPessoa.prototype.nome = function(){\n\tif(arguments.length > 0){\n\t\tthis._nome = arguments[0];\n\t\treturn this;\n\t} else {\n\t\treturn this._nome;\n\t}\n}\"><code>function Pessoa(){}\r\n...\r\nPessoa.prototype.nome = function(){\r\n\tif(arguments.length > 0){\r\n\t\tthis._nome = arguments[0];\r\n\t\treturn this;\r\n\t} else {\r\n\t\treturn this._nome;\r\n\t}\r\n}</code></pre>\r\n\r\n**Onde está a sobrecarga?** Sempre que falamos de sobrecarga de métodos ou funções em linguagens que permitem este recurso vemos vários métodos/funções com assinatura de argumentos e implementação de código diferentes. No nosso caso como javascript não permite isso tivemos que 'simular' este comportamento utilizando o objeto arguments para identificar os argumentos passados para o contexto da função.\r\n\r\nAté aqui você já deve ter notado que trabalhar com sobrecarga em javascript deixa o código do nosso método um pouco complexo e dificil de se manter por causa das verificações e condições que precisam ser incluidas no bloco de código. Vamos ver alguns padrões que poderão nos ajudar a manter o código menos confuso quando estivermos trabalhando com simulação de sobrecarga.\r\n\n### Primeira abordagem (Objeto parâmetro) \n\nUma forma bastante encontrada para resolução deste problema é o uso de um objeto parâmetro. Trata-se de uma função que recebe por argumento um objeto e verifica as propriedades deste objeto como se estivesse verificando os argumentos da função. Imagine uma função que pode receber uma combinação dos parâmetros A, B e C. Para tal esta poderia ser implementada da seguinte forma:\n\n<pre data-stjf=\"\" data-js=\"function log(msg){ document.write('<div>' + msg + '</div>'); }\n\nMeuObjeto = function(){}\n\nMeuObjeto.prototype.myfunc = function(args){\n\tif(args.A && args.B){\n\t\tlog('Sobercarga: Apenas os parametros A e B');\n\t\treturn;\n\t} else if(args.C){\n\t\tlog('Sobercarga: Apenas o parametro C');\n\t\treturn;\n\t}\n\tlog('Erro: Parametros invalidos');\n}\"><code>MeuObjeto = function(){}\n\nMeuObjeto.prototype.myfunc = function(args){\n\t// aqui dentro da função verificamos se o objeto contêm ou não a combinação de propriedades \n\t// desejada e redirecionamos a execução do código\n\tif(args.A && args.B){\n\t\t// faça algo\n\t} else if(args.C){\n\t\t// faça algo\n\t}\n\t...\n}</code></pre>\n\nUm exemplo disso na prática seria a função [ajax](http://api.jquery.com/jQuery.ajax/) do jQuery. Esta pode receber uma combinação de argumentos a partir de um objeto para configurar e executar as requisições.\n\r\n### Segunda abordagem (Funções de apoio)\n\r\n<pre data-stjf='data-stjf' data-js=\"content\"><code>function Pessoa(){}\r\n\r\nPessoa.prototype.nome = function(){\r\n\treturn (arguments[0] == null ? getNome : setNome).call(this, arguments[0]);\r\n}\r\n\r\nfunction getNome(){\r\n\treturn this._nome;\r\n}\r\n\r\nfunction setNome(nome){\r\n\tthis._nome = nome;\r\n\treturn this;\r\n}</code></pre>\r\n\r\nAqui continuamos com a verificação condicional mais veja que separamos a sobrecarga em duas outras funções (getNome e setNome). Isso nos ajuda a manter a simplicidade do código dentro das funções de sobrecarga sem ter que ficar se preocupando com a verificação dos argumentos para descobrir que codigo executar, antes deixamos este trabalho com a função 'nome' que é a função que será invocada para decide sobre qual função de apoio (getNome ou setNome) deverá ser utilizada.\r\n\r\nNote que na função 'nome' verificamos se o primeiro argumento foi ou não passado para a função. Em caso positivo retornamos a funçao setNome e caso contrario retornamos a funçao getNome. Como estas funções utilizam o identificador de contexto 'this' para tentar recuperar o valor de '_nome' precisamos utilizar a função especial 'call' para passar o contexto como argumento. Se você não está familiarizado com as funções especiais call e apply sugiro pesquisar sobre o assunto para entender melhor o código acima.\r\n\r\nAqui podemos ver alguns problemas nesta abordagem. As funções 'getNome' e 'setNome' estão no contexto global do código. Isso é ruim por que estas funções dizem respeito apenas ao objeto 'Pessoa'. Uma forma de tentar amenizar isso é utilizarmos um closure. Segue código reescrito:\r\n\r\n<pre data-stjf='data-stjf' data-js=\"content\"><code>Pessoa = (function(){\r\n\tfunction Pessoa(){}\r\n\t\r\n\tPessoa.prototype.nome = function(){\r\n\t\treturn (arguments[0] == null ? getNome : setNome).call(this, arguments[0]);\r\n\t}\r\n\r\n\tfunction getNome(){\r\n\t\treturn this._nome;\r\n\t}\r\n\r\n\tfunction setNome(nome){\r\n\t\tthis._nome = nome;\r\n\t\treturn this;\r\n\t}\r\n\t\r\n\treturn Pessoa;\r\n})();</code></pre>\r\n\r\nDessa forma as funções getNome e setNome estão 'privadas' acessiveis apenas de dentro do closure sem poluir o contexto global do aplicativo.\r\n\r\n### Terceira abordagem (Funções de apoio em closures)\r\n\r\nNo primeiro exemplo da primeira abordagem vimos um problema. As funções de apoio para a sobrecarga do método 'nome' estavam poluindo o contexto global. Assim reescrevemos o código colocando toda a classe 'Pessoa' dentro de um closure. Ok, mais da mesma forma que as funções de apoio getNome e setNome não precisam ser conhecidas pelo contexto global estas também não precisam ser conhecidas no contexto da class Pessoa, antes estas dizem respeito apenas à função 'nome'. Vamos reescrever mais uma vez este código diminuindo o escopo do closure que mantém privados estes métodos de apoio (getNome e setNome).\r\n\r\n<pre data-stjf='data-stjf' data-js=\"content\"><code>Pessoa = (function(){\r\n    function Pessoa(){}\r\n    \r\n    Pessoa.prototype.nome = (function(){\r\n        function nome(){\r\n            return (arguments[0] == null ? get : set).call(this, arguments[0]);\r\n        }\r\n        \r\n        function get(){\r\n            return this._nome;\r\n        }\r\n        \r\n        function set(nome){\r\n            this._nome = nome;\r\n\t\t\treturn this;\r\n        }\r\n        \r\n        return nome;\r\n    })();\r\n    \r\n    return Pessoa;\r\n})();</code></pre>\r\n\r\nNote que reduzimos o escopo do closure. Com isso conseguimos simplificar o nome das funções de apoio sem com isso perder o entendimento do código. Os nomes 'get' e 'set' fazem total sentido dentro do closure que define a função 'nome'. \r\n\r\nLegal, até aqui vimos algumas abordagens interessantes. Mais daí perguntamos: O que fazer quando a sobrecarga é mais complexa do que um simples get/set? Como ficaria uma função que tivesse por exemplo até 4 opções de sobrecarga com número diferente de parâmetros?\r\n\r\nPara entender melhor vamos a um exemplo: Imagine uma função para retornar o html de uma tag qualquer. Para isso este método teria 4 sobrecargas diferentes onde:\r\n\r\n* Nenhum argumento -> retorna uma string com o codigo da tag 'div'.\r\n* Apenas o primeiro parâmetro -> Nome da tag html, deve retornar uma string com o código da tag passado por parâmetro.\r\n* O primeiro e o segundo parâmetro -> Nome da tag html e um objeto com os atributos desta tag, deve retornar uma string com o código da tag passado por parâmetro incluindo nesta tag os atributos passados no segundo parâmetro.\r\n* O primeiro, segundo e terceiro parâmetro -> Nome da tag html, um objeto com os atributos desta tag e o conteudo desta tag, deve retornar uma string com o código da tag passado por parâmetro incluindo nesta tag os atributos passados no segundo parâmetro e  como conteudo o texto do terceiro parâmetro.\r\n\r\nVou implementar a especificação acima usando uma das abordagens apresentadas até agora. Veja que como temos mais de 2 opções de sobrecarga a tomada de decisão sobre qual método de apoio chamar começa a se complicar.\r\n\r\n<pre data-stjf='data-stjf' data-js=\"content\"><code>CriaHtml = (function(){\r\n\tfunction CriaHtml(){}\r\n\t\r\n\tCriaHtml.prototype.criaTag = (function(){\r\n\t\tfunction criaTag(){\r\n            if(arguments.length == 3)\r\n                return tag3args.apply(this, arguments);\r\n            else if(arguments.length == 2)\r\n                return tag2args.apply(this, arguments);\r\n            else if(arguments.length == 1)\r\n                return tag1args.apply(this, arguments);\r\n            else\r\n                return tag0args.call(this);\r\n\t\t}\r\n\t\t\r\n\t\t// função de apoio - privada\r\n\t\tfunction recuperaAtributos(attrs){\r\n\t\t\tvar str = ' ';\r\n\t\t\tfor(var att in attrs){ str += att + '=\"' + attrs[att] + '\" '; }\r\n\t\t\treturn str;\r\n\t\t}\r\n\t\t\r\n\t\tfunction tag3args(tag, attrs, content)\r\n\t\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '&gt;' + content + '&lt;/' + tag + '&gt;';\r\n\t\t}\r\n\t\t\r\n\t\tfunction tag2args(tag, attrs){\r\n\t\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '/&gt;';\r\n\t\t}\r\n\r\n\t\tfunction tag1args(tag){\r\n\t\t\treturn '&lt;' + tag + '/&gt;';\r\n\t\t}\r\n\t\t\r\n\t\tfunction tag0args(){\r\n\t\t\treturn '&lt;div&gt;&lt;/div&gt;';\r\n\t\t}\r\n\r\n\t\treturn criaTag;\r\n\t})();\r\n\t\r\n\treturn CriaHtml;\r\n})();</code></pre>\r\n\r\nVeja que neste caso tivemos que utilizar uma cadeia de 'ifs' para verificar a quantidade de argumentos passados para a função. Caso nossa função tivesse como requisito da sovbrecarga tipos deferentes de argumentos teríamos de adicionar muitas outras condições dexando nosso código cada vez mais complexo. Vamos ver abaixo algumas outras abordagem com o objetivo de facilitar um pouco mais este trabalho removendo a complexidade das verificações condicionais.\r\n\r\n### Quarta abordagem (Utilizando indices para mapeamento de funções)\r\n\r\nNesta quarta abordagem iremos utilizar um dicionário para verificar as sobrecargas. Antes de implementar o ultimo código da seção anterior vamos voltar ao nosso exemplo get/set para assimilar o conceito:\r\n\r\n<pre data-stjf='data-stjf' data-js=\"content\"><code>Pessoa = (function(){\r\n    function Pessoa(){}\r\n    \r\n    Pessoa.prototype.nome = (function(){\r\n        var overloads = {};\r\n        \r\n        overloads[0] = function(){\r\n            return this._nome;\r\n        }\r\n        \r\n        overloads[1] = function(nome){\r\n            this._nome = nome;\r\n\t\t\treturn this;\r\n        }\r\n\r\n        return function(){\r\n            return overloads[arguments.length].apply(this, arguments)\r\n        }\r\n    })();\r\n    \r\n    return Pessoa;\r\n})();</code></pre>\r\n\r\nVeja que criamos um dicionário 'overloads' e adicionamos nele as funções de sobrecarga utilizando neste caso o número de argumentos como indice para recupera-las. Assim se não passarmos nenhum arqumento iremos acessar a chave zero correspondente a função 'get' e caso passemos um valor iremos acessar a função armazenada na chave 1 que corresponde a função 'set'.\r\n\r\nAgora que vimos um exemplo simples vamos ao nosso exemplo mais complexo para este caso:\r\n\r\n<pre data-stjf='data-stjf' data-js=\"content\"><code>CriaHtml = (function(){\r\n\tfunction CriaHtml(){}\r\n\t\r\n\tCriaHtml.prototype.criaTag = (function(){\r\n        var overloads = {};\r\n\t\t\r\n\t\t// função de apoio - privada\t\t\r\n\t\tfunction recuperaAtributos(attrs){\r\n\t\t\tvar str = ' ';\r\n\t\t\tfor(var att in attrs){ str += att + '=\"' + attrs[att] + '\" '; }\r\n\t\t\treturn str;\r\n\t\t}\r\n\t\t\r\n\t\toverloads[3] = function(tag, attrs, content){\r\n\t\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '&gt;' + content + '&lt;/' + tag + '&gt;';\r\n\t\t}\r\n\t\t\r\n\t\toverloads[2] = function(tag, attrs){\r\n\t\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '/&gt;';\r\n\t\t}\r\n\r\n\t\toverloads[1] = function(tag){\r\n\t\t\treturn '&lt;' + tag + '/&gt;';\r\n\t\t}\r\n\t\t\r\n\t\toverloads[0] = function(tag){\r\n\t\t\treturn '&lt;div&gt;&lt;/div&gt;';\r\n\t\t}\r\n\r\n        return function(){\r\n            return overloads[arguments.length].apply(this, arguments);\r\n        }\r\n\t})();\r\n\t\r\n\treturn CriaHtml;\r\n})();</code></pre>\r\n\r\nComo podemos ver esta abordagem elimina por completo as verificações condicionais que tinhamos antes além de deixar o código mais fácil de ler e evitar que fiquemos criando nomes diferentes para cada função de sobrecarga.\r\n\r\n### Quarta abordagem (Usando mapeamento de tipo)\r\n\r\nAgora suponha que a nossa sobrecarga não diz respeito mais ao número de argumentos passado para a função mais sim ao tipo destes argumentos. Imagine uma função em nossa classe Pessoa chamda 'informe' que caso seja passado uma string ele retorne o texto 'você informou o nome &lt;string passada por argumento&gt;' e caso seja passado um numero ele retorne 'você informou a idade &lt;numero passada por argumento&gt;'. Para isso utilizaremos uma abordagem parecida com a anterior só que no dicionário ao invés de termos o número de argumentos como chave vamos ter o tipo do argumento.\r\n\r\n<pre data-stjf='data-stjf' data-js=\"content\"><code>Pessoa = (function(){\r\n    function Pessoa(){}\r\n    ...\r\n    Pessoa.prototype.informe = (function(){\r\n        var overloads = {};\r\n        \r\n        overloads['string'] = function(nome){\r\n\t\t\treturn 'você informou o nome ' + nome;\r\n        }\r\n        \r\n        overloads['number'] = function(idade){\r\n\t\t\treturn 'você informou a idade ' + idade;\r\n        }\r\n\r\n        return function(){\r\n            return overloads[typeof arguments[0]].apply(this, arguments)\r\n        }\r\n    })();\r\n    ...\r\n    return Pessoa;\r\n})();</code></pre>\r\n\r\nSimples não é? Com isso evitamos utilizar 'ifs' para ter que descobrir o tipo dos argumentos para então invocar a função de apoio correspondente. Tendo esta abodagem em mente podemos reescrever o código da classe 'CriaHtml' da seguinte forma:\r\n\r\n<pre data-stjf='data-stjf' data-js=\"content\"><code>CriaHtml = (function(){\r\n\tfunction CriaHtml(){}\r\n\t\r\n\tCriaHtml.prototype.criaTag = (function(){\r\n        var overloads = {};\r\n\t\t\r\n\t\t// função de apoio - privada\r\n\t\tfunction recuperaAtributos(attrs){\r\n\t\t\tvar str = ' ';\r\n\t\t\tfor(var att in attrs){ str += att + '=\"' + attrs[att] + '\" '; }\r\n\t\t\treturn str;\r\n\t\t}\r\n\t\t\r\n\t\toverloads['string_object_string'] = function(tag, attrs, content){\r\n\t\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '&gt;' + content + '&lt;/' + tag + '&gt;';\r\n\t\t}\r\n\t\t\r\n\t\toverloads['string_object'] = function(tag, attrs){\r\n\t\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '/&gt;';\r\n\t\t}\r\n\r\n\t\toverloads['string'] = function(tag){\r\n\t\t\treturn '&lt;' + tag + '/&gt;';\r\n\t\t}\r\n\t\t\r\n\t\toverloads[''] = function(tag){\r\n\t\t\treturn '&lt;div&gt;&lt;/div&gt;';\r\n\t\t}\r\n\r\n        return function(){\r\n\t\t\tvar sign = '';\r\n\t\t\tfor(var i=0; i&lt;arguments.length; i++) { sign += (sign == ''? '' : '_') + typeof arguments[i]; }\r\n            return overloads[sign].apply(this, arguments);\r\n        }\r\n\t})();\r\n\t\r\n\treturn CriaHtml;\r\n})();</code></pre>\r\n\r\nVeja que o código das sobrecargas fica mais fácil de entender pois destacamos o tipo de sobrecarga tratado por cada função de apoio.\r\n\n## Quinta abordagem (Cadeia de Responsabilidades)\n\nAlgumas das abordagens apresentadas acima podem ser simplificadas se utilizarmos uma função de apoio para criar as sobrecargas utilizando o conceito do padrão da Cadeia de Responsabilidades [(Chain of Responsibility)](http://en.wikipedia.org/wiki/Chain-of-responsibility_pattern). Note que não vamos implementar o padrão em sua forma sugerida, vamos apenas se utilizar do conceito dele para nossa implementação que será com funções e não com classes. Você pode acessar o link anterior para entender melhor este padrão. Explicando de forma bam rapida trata-se de um padrão onde escrevemos algumas classes para tratar um determinado contexto, cada uma com uma implementação especifica. Estas classes são alinhadas uma após a outra referenciando quem está acima dela para tentar processar o contexto caso esta não consiga processa-lo. Daí quando solicitamos uma das classes da cadeia um determinado processamento, caso esta não consiga responder esta solicitação esta irá passar a responsabilidade deste processamento para quem estiver encadeado acima dele, caso exista alguém. Isso é feito sucessivamente até que alguem consiga aceitar e processar a requisição.\n\nA idéia aqui é utilizar uma abordagem sugeria por [John Resig](http://ejohn.org/blog/javascript-method-overloading/) para solução de sobrecargas mesclando esta solução com as abordagens apresentadas neste artigo até aqui (as que permitem esta implementação).\n\nJohn Resig sugeriu escrevermos a seguinte função de apoio:\n\n<pre data-stjf='data-stjf' data-js=\"function log(msg){ document.write('<div>' + msg + '</div>'); }\n\n// addMethod - By John Resig (MIT Licensed)\nfunction addMethod(object, name, fn){\n    var old = object[ name ];\n    object[ name ] = function(){\n        if ( fn.length == arguments.length )\n            return fn.apply( this, arguments );\n        else if ( typeof old == 'function' )\n            return old.apply( this, arguments );\n    };\n}\n\nfunction Users(){\n  addMethod(this, 'find', function(){\n    log('Find all users...');\n  });\n  addMethod(this, 'find', function(name){\n    log('Find a user by name');\n  });\n  addMethod(this, 'find', function(first, last){\n    log('Find a user by first and last name');\n  });\n}\n\nvar user = new Users();\n\nuser.find();\nuser.find('name');\nuser.find('name', 'last');\"><code>// addMethod - By John Resig (MIT Licensed)\nfunction addMethod(object, name, fn){\n    var old = object[ name ];\n    object[ name ] = function(){\n        if ( fn.length == arguments.length )\n            return fn.apply( this, arguments );\n        else if ( typeof old == 'function' )\n            return old.apply( this, arguments );\n    };\n}</code></pre>\n\nEsta função seria utilizada da seguinte forma:\n\n<pre><code>function Users(){\n  addMethod(this, \"find\", function(){\n    // Find all users...\n  });\n  addMethod(this, \"find\", function(name){\n    // Find a user by name\n  });\n  addMethod(this, \"find\", function(first, last){\n    // Find a user by first and last name\n  });\n}</code></pre>\n\nVamos tentar entender o que está acontecendo. A função 'addMethod' recebe por argumento um objeto (o objeto ao qual queremos adicionar a função de sobrecarga), um nome (o nome da função a ser adicionada) e uma função anônima com o código da implementação da sobrecarga. Esta função armazena o conteudo da função anterior de mesmo nome caso exista em uma variável chamada old e coloca uma nova função no lugar da anterior. Daí é feito um teste que verifica se a quantidade de argumentos passados para a função é igual a quantidade de argumentos que a função de sobrecarga adicionada se propõe a tratar. Caso positivo a função de sobrecarga é chamada e a requisição é passada. Caso contrário verificamos se a função que outrora estava armazenada no lugar desta existe e caso exista passamos para ela a responsabilidade de execução da chamada.\n\nEntendendo isso podemos reescrever a nossa *quarta abordagem* da seguinte forma:\n\n<pre data-stjf='data-stjf' data-js=\"content\"><code>// repare que alteramos um pouco esta função de apoio\n// em relação ao que foi sugerido por Resig\nfunction adicioneSobrecarga(objeto, nome, fn){\n    var anterior = objeto.prototype[ nome ];\n    objeto.prototype[ nome ] = function(){\n        if ( fn.length == arguments.length )\n            return fn.apply( this, arguments );\n        else if ( typeof anterior == 'function' )\n            return anterior.apply( this, arguments );\n    };\n}\n\nCriaHtml = (function(){\n\tfunction CriaHtml(){}\n\n\t// função de apoio - privada\t\t\n\tfunction recuperaAtributos(attrs){\n\t\tvar str = ' ';\n\t\tfor(var att in attrs){ str += att + '=\"' + attrs[att] + '\" '; }\n\t\treturn str;\n\t}\n\t\n\tadicioneSobrecarga(CriaHtml, 'criaTag', function(tag, attrs, content){\n\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '&gt;' + content + '&lt;/' + tag + '&gt;';\n\t});\n\n\tadicioneSobrecarga(CriaHtml, 'criaTag', function(tag, attrs){\n\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '/&gt;';\n\t});\n\n\tadicioneSobrecarga(CriaHtml, 'criaTag', function(tag){\n\t\treturn '&lt;' + tag + '/&gt;';\n\t});\n\n\tadicioneSobrecarga(CriaHtml, 'criaTag', function(tag){\n\t\treturn '&lt;div&gt;&lt;/div&gt;';\n\t});\n\t\n\treturn CriaHtml;\n})();</code></pre>\n\nAgora com um pouco de alteração podemos implementar nossa *quarta abordagem* como no código que se segue:\n\n<pre data-stjf='data-stjf' data-js=\"content\"><code>// repare que alteramos um pouco esta função de apoio\n// em relação ao que foi sugerido por Resig\nfunction adicioneSobrecarga(objeto, tipos, nome, fn){\n\tfunction recuperaAssinatura(){\n\t\tvar sign = '';\n\t\tfor(var i=0; i&lt;arguments.length; i++) { sign += (sign == ''? '' : '_') + typeof arguments[i]; }\n\t\treturn sign;\n\t}\n\n    var anterior = objeto.prototype[ nome ];\n    objeto.prototype[ nome ] = function(){\n        if ( recuperaAssinatura(fn) == recuperaAssinatura(this) )\n            return fn.apply( this, arguments );\n        else if ( typeof anterior == 'function' )\n            return anterior.apply( this, arguments );\n    };\n}\n\nCriaHtml = (function(){\n\tfunction CriaHtml(){}\n\n\t// função de apoio - privada\n\tfunction recuperaAtributos(attrs){\n\t\tvar str = ' ';\n\t\tfor(var att in attrs){ str += att + '=\"' + attrs[att] + '\" '; }\n\t\treturn str;\n\t}\n\t\n\tadicioneSobrecarga(CriaHtml, 'string_object_string', 'criaTag', function(tag, attrs, content){\n\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '&gt;' + content + '&lt;/' + tag + '&gt;';\n\t});\n\t\n\tadicioneSobrecarga(CriaHtml, 'string_object_string', 'criaTag', function(tag, attrs){\n\t\treturn '&lt;' + tag + recuperaAtributos(attrs) + '/&gt;';\n\t});\n\n\tadicioneSobrecarga(CriaHtml, 'string_object_string', 'criaTag', function(tag){\n\t\treturn '&lt;' + tag + '/&gt;';\n\t});\n\n\tadicioneSobrecarga(CriaHtml, 'string_object_string', 'criaTag', function(tag){\n\t\treturn '&lt;div&gt;&lt;/div&gt;';\n\t});\n\t\n\treturn CriaHtml;\n})();</code></pre>\n\r\n## Conclusão\r\n\r\nQual abordagem utilizar?\r\n\r\nIsso vai depender da complexidade da implementação. O padrão é manter o senso e utilizar sempre uma abordagem de código que não complique sua vida e nem a leitura e manutenção do código.\r\n\r\nAbraços!\n","ref":"javascript_overload_function.post.mkdown"}